let AzureSignins = SigninLogs
| project UserPrincipalName, IPAddress, TimeGenerated;
let AWSSignins = AWSCloudTrail
| project UserIdentityArn, SourceIpAddress, TimeGenerated;
AzureSignins
| join kind=inner (AWSSignins) on $left.IPAddress == $right.SourceIpAddress
| extend CombinedUser = strcat(UserPrincipalName, " / ", UserIdentityArn)
| project TimeGenerated, CombinedUser, IPAddress
