OfficeActivity
| where Workload == "Microsoft Flow"
| where Operation in ("CreatedFlow", "EditedFlow", "SharedFlow", "ExportedFlow")
| extend Connector = tostring(AdditionalDetails.ConnectorName)
| where Connector has_any ("Dropbox", "Gmail", "HTTP", "GoogleDrive")
| extend FlowName = tostring(AdditionalDetails.FlowDisplayName)
| project TimeGenerated, UserId, Connector, FlowName, Operation, ClientIP
| summarize FlowCount = count() by UserId, Connector
| where FlowCount > 2
